interface MorseToUkrainianMap {
  [key: string]: string;
}

const morseToUkrainian: MorseToUkrainianMap = {
  '.-': 'А',
  '-...': 'Б',
  '.--': 'В',
  '--.': 'Г',
  '-..': 'Д',
  '.': 'Е',
  '...-': 'Є',
  '..-.': 'Ж',
  '--..': 'З',
  '..': 'И',
  '.---': 'І',
  '-.-': 'К',
  '.-..': 'Л',
  '--': 'М',
  '-.': 'Н',
  '---': 'О',
  '.--.': 'П',
  '.-.': 'Р',
  '...': 'С',
  '-': 'Т',
  '..-': 'У',
  '..--': 'Ф',
  '....': 'Х',
  '-.-.': 'Ц',
  '---.': 'Ч',
  '----': 'Ш',
  '--.-': 'Щ',
  '--.--': 'Ю',
  '..-..': 'Я',
  '-----': '0',
  '.----': '1',
  '..---': '2',
  '...--': '3',
  '....-': '4',
  '.....': '5',
  '-....': '6',
  '--...': '7',
  '---..': '8',
  '----.': '9',
  '.-.-.-': '.',
  '--..--': ',',
  '..--..': '?',
  '-..-.': '/',
  '-.--.-': ')',
  '-....-': '-',
  '-...-': '=',
  '.----.': "'",
  '.-..-.': '"',
  '.-.-.': 'Ь',
  '-..-': 'Ґ',
  '...-...': '...',
  '-.-.-.': ';',
  '-.-.--': '!',
  '-.--.': 'Я'
};

export const morseDecoder = (morseCode: string) => {
  const words = morseCode.split('  '); 
  const translatedText = words
    .map(word =>
      word
        .split(' ')
        .map(morseChar => morseToUkrainian[morseChar] || ' ') 
        .join('')
    )
    .join(' ');

  return translatedText;
}